## TASK 1

In [ ]:
source("./Imports.R")

### Selects 10 most voted locations from table Users with their vote Counts

In [33]:
sql_1 <- function(Users){
    sqldf("SELECT Location, SUM(UpVotes) as TotalUpVotes 
        FROM Users
        WHERE Location != ''
        GROUP BY Location
        ORDER BY TotalUpVotes DESC
        LIMIT 10")
}

In [34]:
base_1 <- function(Users){
    users_with_location_filter <- subset(Users, Location != "")
    locations_agg <- aggregate(UpVotes ~ Location, data = users_with_location_filter, sum)
    locations_sorted <- locations_agg[order(locations_agg$UpVotes, decreasing = TRUE),]
    location_head <- head(locations_sorted, 10)
    colnames(location_head)[2] <- "TotalUpVotes"
    return(location_head)
}

In [35]:
dplyr_1 <- function(Users) {
    as.data.frame(
        Users %>%
            filter(Location != "") %>%
            group_by(Location) %>%
            summarize(TotalUpVotes = sum(UpVotes)) %>%
            arrange(desc(TotalUpVotes)) %>%
            head(10)
    )
}

In [36]:
table_1 <- function(Users) {
    setDT(Users)
    as.data.frame(
        Users[
            Location != "",
            .(TotalUpVotes = sum(UpVotes)),
            by = Location][order(-TotalUpVotes)][1:10]
    )
}

In [37]:
comp(
    sql_1(Users),
    base_1(Users),
    dplyr_1(Users),
    table_1(Users)
)

[1] "COMPARING GIVEN OUTPUTS TO SQL ONE: "
[1] "BASE: TRUE"
[1] "DPLYR: TRUE"
[1] "TABLE: TRUE"

In [38]:
table_1(Users)

   Location                  TotalUpVotes
1  London, UK                26206
2  Netherlands               24146
3  London, United Kingdom    21941
4  Oxford, United Kingdom    20158
5  Christchurch, New Zealand 16352
6  UK                        10967
7  New York, NY               9126
8  Singapore                  8905
9  Cambridge, United Kingdom  8550
10 Australia                  8396